# TrussMemberInfo Properties

---
The TrussMemberInfo type exposes the following members.
| Name| Description
---|---|---
| hostTrussId| The host truss' ElementId of the member.
| lockedToTruss| Whether the member is locked to the host truss.
| memberTypeKey| Kind of the member in the truss.
Top
#### Reference
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace